#### terraform plan every: b5e73f6
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:us-east-1:554506578892:certificate/cd63d2a1-3d6f-471d-958e-45a76da21eb0]
aws_iam_role.iam_role_for_lambda: Refreshing state... [id=lambda-invoke-role]
module.alb-lambda.aws_internet_gateway.main: Refreshing state... [id=igw-0ecc8ba5f070e3a1c]
module.alb-lambda.aws_route53_record.main: Refreshing state... [id=Z04052072YGY8CIREK2A2_spotify-line-bot.moikilo00.net_CNAME]
module.alb-lambda.aws_security_group_rule.ingress_lb_http: Refreshing state... [id=sgrule-2805189883]
aws_cloudwatch_log_group.log_group: Refreshing state... [id=/aws/lambda/java_lambda_function]
aws_api_gateway_rest_api.example: Refreshing state... [id=uo7vejn591]
module.alb-lambda.aws_route.public: Refreshing state... [id=r-rtb-0d9cdefb8207863bd1080289494]
module.alb-lambda.aws_subnet.publics[0]: Refreshing state... [id=subnet-0b97e1bb37b7dfab2]
module.alb-lambda.aws_security_group_rule.nsg_lb_egress_rule: Refreshing state... [id=sgrule-4251056976]
module.alb-lambda.aws_alb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/spotify-line-bot-develop/705c461e88da1532/1f683d7416cb5e15]
module.alb-lambda.aws_security_group_rule.nsg_lambda_ingress_rule: Refreshing state... [id=sgrule-2429044596]
module.alb-lambda.aws_security_group_rule.ingress_lb_https: Refreshing state... [id=sgrule-3283710764]
module.alb-lambda.aws_lb_target_group_attachment.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/spotify-line-bot-develop/c0d7778a20579ddf-20210722032501636900000002]
module.alb-lambda.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d744d0d6d3a2e7f7]
aws_lambda_function.java_lambda_function: Refreshing state... [id=java_lambda_function]
module.alb-lambda.aws_s3_bucket.lb_access_logs: Refreshing state... [id=spotify-line-bot-develop-lb-access-logs]
module.alb-lambda.aws_acm_certificate_validation.cert: Refreshing state... [id=2021-07-22 03:25:11 +0000 UTC]
module.alb-lambda.aws_alb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/spotify-line-bot-develop/c0d7778a20579ddf]
module.alb-lambda.aws_subnet.publics[2]: Refreshing state... [id=subnet-01f5364194630546b]
module.alb-lambda.aws_lambda_permission.allow_alb_to_invoke_lambda: Refreshing state... [id=AllowExecutionFromALB]
module.alb-lambda.aws_security_group.nsg_lambda: Refreshing state... [id=sg-033b149fcb4b7e709]
module.alb-lambda.aws_s3_bucket_policy.lb_access_logs: Refreshing state... [id=spotify-line-bot-develop-lb-access-logs]
module.alb-lambda.aws_alb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/spotify-line-bot-develop/705c461e88da1532/34dd1fad4b3f79d4]
module.alb-lambda.aws_security_group.nsg_lb: Refreshing state... [id=sg-06a2f9348ee5a05a5]
module.alb-lambda.aws_iam_role_policy.cloudwatch: Refreshing state... [id=spotify-line-bot-develop:cw-spotify-line-bot-develop]
module.alb-lambda.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:ap-northeast-1:554506578892:certificate/1a3a8d4b-d3d8-4b77-9294-4a2b4737e0db]
module.alb-lambda.aws_subnet.publics[1]: Refreshing state... [id=subnet-0c44b50b1f455b098]
module.alb-lambda.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0154854afe57eec1b]
module.alb-lambda.aws_route_table.public: Refreshing state... [id=rtb-0d9cdefb8207863bd]
module.alb-lambda.aws_cloudwatch_dashboard.cloudwatch_dashboard: Refreshing state... [id=spotify-line-bot-develop]
module.alb-lambda.aws_route53_record.validations["spotify-line-bot.moikilo00.net"]: Refreshing state... [id=Z04052072YGY8CIREK2A2__5e39c3066d148ff7098e8aff2206c4e9.spotify-line-bot.moikilo00.net._CNAME]
module.alb-lambda.aws_vpc.main: Refreshing state... [id=vpc-06be3f4bb32bf767f]
module.alb-lambda.aws_iam_role.app_role: Refreshing state... [id=spotify-line-bot-develop]
module.alb-lambda.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-02cb0e043150ade26]
module.alb-lambda.aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:loadbalancer/app/spotify-line-bot-develop/705c461e88da1532]
module.alb-lambda.aws_security_group_rule.nsg_lambda_egress_rule: Refreshing state... [id=sgrule-1358367443]
aws_iam_policy.iam_policy_for_lambda: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda-invoke-policy]
aws_dynamodb_table.spotify-poc: Refreshing state... [id=spotify-poc]
aws_dynamodb_table.spotify-dynamo-music: Refreshing state... [id=spotify-dynamo-music]
aws_api_gateway_resource.proxy: Refreshing state... [id=ixthbt]
aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-uo7vejn591-6s0om962qh-ANY]
aws_route53_record.validations["spotify-line.moikilo00.net"]: Refreshing state... [id=Z04052072YGY8CIREK2A2__e2490495fb7f42c5629334ae790825dc.spotify-line.moikilo00.net._CNAME]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-uo7vejn591-ixthbt-ANY]
aws_iam_role_policy_attachment.aws_iam_role_policy_attachment: Refreshing state... [id=lambda-invoke-role-20210517054657159100000001]
aws_api_gateway_integration.lambda_root: Refreshing state... [id=agi-uo7vejn591-6s0om962qh-ANY]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-uo7vejn591-ixthbt-ANY]
aws_api_gateway_deployment.example: Refreshing state... [id=7avmde]
aws_acm_certificate_validation.main: Refreshing state... [id=2021-06-30 02:30:13 +0000 UTC]
aws_iam_policy.lambda_dynamo: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda_dynamo-policy]
aws_iam_policy.lambda_dynamo_music: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda_dynamo_music-policy]
aws_api_gateway_domain_name.main: Refreshing state... [id=spotify-line.moikilo00.net]
aws_route53_record.spotify-line: Refreshing state... [id=Z04052072YGY8CIREK2A2_spotify-line.moikilo00.net_A]
aws_iam_role_policy_attachment.lambda_dynamo_music: Refreshing state... [id=lambda-invoke-role-20210628073423139200000001]
aws_iam_role_policy_attachment.lambda_dynamo: Refreshing state... [id=lambda-invoke-role-20210517180640035500000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_deployment.example must be replaced
-/+ resource "aws_api_gateway_deployment" "example" {
      ~ created_date  = "2021-05-24T00:58:42Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ap-northeast-1:554506578892:uo7vejn591/test" -> (known after apply)
      ~ id            = "7avmde" -> (known after apply)
      ~ invoke_url    = "https://uo7vejn591.execute-api.ap-northeast-1.amazonaws.com/test" -> (known after apply)
      ~ stage_name    = "test" -> "develop" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_integration.lambda will be updated in-place
  ~ resource "aws_api_gateway_integration" "lambda" {
        id                      = "agi-uo7vejn591-ixthbt-ANY"
      ~ uri                     = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:554506578892:function:java_lambda_function/invocations" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.lambda_root will be updated in-place
  ~ resource "aws_api_gateway_integration" "lambda_root" {
        id                      = "agi-uo7vejn591-6s0om962qh-ANY"
      ~ uri                     = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:554506578892:function:java_lambda_function/invocations" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.log_group must be replaced
-/+ resource "aws_cloudwatch_log_group" "log_group" {
      ~ arn               = "arn:aws:logs:ap-northeast-1:554506578892:log-group:/aws/lambda/java_lambda_function" -> (known after apply)
      ~ id                = "/aws/lambda/java_lambda_function" -> (known after apply)
      ~ name              = "/aws/lambda/java_lambda_function" -> "/aws/lambda/spotify_lambda" # forces replacement
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.java_lambda_function will be destroyed
  - resource "aws_lambda_function" "java_lambda_function" {
      - arn                            = "arn:aws:lambda:ap-northeast-1:554506578892:function:java_lambda_function" -> null
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
      - filename                       = "../app/build/libs/app-all.jar" -> null
      - function_name                  = "java_lambda_function" -> null
      - handler                        = "terraform.spotify.lambda.poc.handler.LambdaHandler" -> null
      - id                             = "java_lambda_function" -> null
      - image_uri                      = "" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:554506578892:function:java_lambda_function/invocations" -> null
      - kms_key_arn                    = "" -> null
      - last_modified                  = "2021-07-23T18:07:05.508+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 1536 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-northeast-1:554506578892:function:java_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::554506578892:role/lambda-invoke-role" -> null
      - runtime                        = "java11" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      - source_code_hash               = "NuZi7H6E4EqvL14SbOARiKsvgF3Q8WmfbyNaZ188Eco=" -> null
      - source_code_size               = 36466444 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 60 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "LINE_BOT_CHANNEL_ACCESS_TOKEN" = (sensitive)
              - "SPOTIFY_CLIENT_ID"             = (sensitive)
              - "SPOTIFY_CLIENT_SECRET"         = (sensitive)
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.spotify_lambda will be created
  + resource "aws_lambda_function" "spotify_lambda" {
      + arn                            = (known after apply)
      + filename                       = "../app/build/libs/app-all.jar"
      + function_name                  = "spotify_lambda"
      + handler                        = "terraform.spotify.lambda.poc.handler.LambdaHandler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1536
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::554506578892:role/lambda-invoke-role"
      + runtime                        = "java11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "Nqy9/MGNcNoCmEj6Gf8/nKkLVEjcbbB1hYVy3JHZpY8="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "LINE_BOT_CHANNEL_ACCESS_TOKEN" = (sensitive)
              + "SPOTIFY_CLIENT_ID"             = (sensitive)
              + "SPOTIFY_CLIENT_SECRET"         = (sensitive)
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.apigw must be replaced
-/+ resource "aws_lambda_permission" "apigw" {
      ~ function_name = "java_lambda_function" -> "spotify_lambda" # forces replacement
      ~ id            = "AllowAPIGatewayInvoke" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.alb-lambda.aws_acm_certificate.cert will be destroyed
  - resource "aws_acm_certificate" "cert" {
      - arn                       = "arn:aws:acm:ap-northeast-1:554506578892:certificate/1a3a8d4b-d3d8-4b77-9294-4a2b4737e0db" -> null
      - domain_name               = "spotify-line-bot.moikilo00.net" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "spotify-line-bot.moikilo00.net"
              - resource_record_name  = "_5e39c3066d148ff7098e8aff2206c4e9.spotify-line-bot.moikilo00.net."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_8d14945b5eeab67de2d726be1a11c433.tgztlnjmjp.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:ap-northeast-1:554506578892:certificate/1a3a8d4b-d3d8-4b77-9294-4a2b4737e0db" -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [] -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.alb-lambda.aws_acm_certificate_validation.cert will be destroyed
  - resource "aws_acm_certificate_validation" "cert" {
      - certificate_arn         = "arn:aws:acm:ap-northeast-1:554506578892:certificate/1a3a8d4b-d3d8-4b77-9294-4a2b4737e0db" -> null
      - id                      = "2021-07-22 03:25:11 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_5e39c3066d148ff7098e8aff2206c4e9.spotify-line-bot.moikilo00.net",
        ] -> null
    }

  # module.alb-lambda.aws_alb.main will be destroyed
  - resource "aws_alb" "main" {
      - arn                        = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:loadbalancer/app/spotify-line-bot-develop/705c461e88da1532" -> null
      - arn_suffix                 = "app/spotify-line-bot-develop/705c461e88da1532" -> null
      - dns_name                   = "spotify-line-bot-develop-1984214338.ap-northeast-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields = false -> null
      - enable_deletion_protection = false -> null
      - enable_http2               = true -> null
      - id                         = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:loadbalancer/app/spotify-line-bot-develop/705c461e88da1532" -> null
      - idle_timeout               = 60 -> null
      - internal                   = false -> null
      - ip_address_type            = "ipv4" -> null
      - load_balancer_type         = "application" -> null
      - name                       = "spotify-line-bot-develop" -> null
      - security_groups            = [
          - "sg-06a2f9348ee5a05a5",
        ] -> null
      - subnets                    = [
          - "subnet-01f5364194630546b",
          - "subnet-0b97e1bb37b7dfab2",
          - "subnet-0c44b50b1f455b098",
        ] -> null
      - tags                       = {
          - "Name" = "spotify-line-develop"
        } -> null
      - tags_all                   = {
          - "Name" = "spotify-line-develop"
        } -> null
      - vpc_id                     = "vpc-06be3f4bb32bf767f" -> null
      - zone_id                    = "Z14GRHDCWA56QT" -> null

      - access_logs {
          - bucket  = "spotify-line-bot-develop-lb-access-logs" -> null
          - enabled = true -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-01f5364194630546b" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0b97e1bb37b7dfab2" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0c44b50b1f455b098" -> null
        }
    }

  # module.alb-lambda.aws_alb_listener.http will be destroyed
  - resource "aws_alb_listener" "http" {
      - arn               = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/spotify-line-bot-develop/705c461e88da1532/1f683d7416cb5e15" -> null
      - id                = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/spotify-line-bot-develop/705c461e88da1532/1f683d7416cb5e15" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:loadbalancer/app/spotify-line-bot-develop/705c461e88da1532" -> null
      - port              = 80 -> null
      - protocol          = "HTTP" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null

      - default_action {
          - order = 1 -> null
          - type  = "redirect" -> null

          - redirect {
              - host        = "#{host}" -> null
              - path        = "/#{path}" -> null
              - port        = "443" -> null
              - protocol    = "HTTPS" -> null
              - query       = "#{query}" -> null
              - status_code = "HTTP_301" -> null
            }
        }
    }

  # module.alb-lambda.aws_alb_listener.https will be destroyed
  - resource "aws_alb_listener" "https" {
      - arn               = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/spotify-line-bot-develop/705c461e88da1532/34dd1fad4b3f79d4" -> null
      - certificate_arn   = "arn:aws:acm:ap-northeast-1:554506578892:certificate/1a3a8d4b-d3d8-4b77-9294-4a2b4737e0db" -> null
      - id                = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:listener/app/spotify-line-bot-develop/705c461e88da1532/34dd1fad4b3f79d4" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:loadbalancer/app/spotify-line-bot-develop/705c461e88da1532" -> null
      - port              = 443 -> null
      - protocol          = "HTTPS" -> null
      - ssl_policy        = "ELBSecurityPolicy-2016-08" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/spotify-line-bot-develop/c0d7778a20579ddf" -> null
          - type             = "forward" -> null
        }
    }

  # module.alb-lambda.aws_alb_target_group.main will be destroyed
  - resource "aws_alb_target_group" "main" {
      - arn                                = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/spotify-line-bot-develop/c0d7778a20579ddf" -> null
      - arn_suffix                         = "targetgroup/spotify-line-bot-develop/c0d7778a20579ddf" -> null
      - deregistration_delay               = 300 -> null
      - id                                 = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/spotify-line-bot-develop/c0d7778a20579ddf" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - name                               = "spotify-line-bot-develop" -> null
      - port                               = 80 -> null
      - protocol                           = "HTTP" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {
          - "Name" = "spotify-line-develop"
        } -> null
      - tags_all                           = {
          - "Name" = "spotify-line-develop"
        } -> null
      - target_type                        = "lambda" -> null
      - vpc_id                             = "vpc-06be3f4bb32bf767f" -> null

      - health_check {
          - enabled             = false -> null
          - healthy_threshold   = 5 -> null
          - interval            = 35 -> null
          - matcher             = "200" -> null
          - path                = "/" -> null
          - timeout             = 30 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {}
    }

  # module.alb-lambda.aws_cloudwatch_dashboard.cloudwatch_dashboard will be destroyed
  - resource "aws_cloudwatch_dashboard" "cloudwatch_dashboard" {
      - dashboard_arn  = "arn:aws:cloudwatch::554506578892:dashboard/spotify-line-bot-develop" -> null
      - dashboard_body = jsonencode(
            {
              - widgets = [
                  - {
                      - height     = 6
                      - properties = {
                          - metrics = [
                              - [
                                  - "AWS/Lambda",
                                  - "Throttles",
                                  - "FunctionName",
                                  - "java_lambda_function",
                                  - {
                                      - color  = "#ff7f0e"
                                      - period = 60
                                      - stat   = "Average"
                                    },
                                ],
                              - [
                                  - ".",
                                  - "Invocations",
                                  - ".",
                                  - ".",
                                  - {
                                      - color  = "#2ca02c"
                                      - period = 60
                                      - stat   = "Average"
                                    },
                                ],
                              - [
                                  - ".",
                                  - "Errors",
                                  - ".",
                                  - ".",
                                  - {
                                      - color  = "#d62728"
                                      - period = 60
                                      - stat   = "Average"
                                    },
                                ],
                            ]
                          - period  = 300
                          - region  = "ap-northeast-1"
                          - stacked = false
                          - title   = "Lambda"
                          - view    = "timeSeries"
                          - yAxis   = {
                              - left = {
                                  - max = 100
                                  - min = 0
                                }
                            }
                        }
                      - type       = "metric"
                      - width      = 12
                      - x          = 12
                      - y          = 0
                    },
                  - {
                      - height     = 6
                      - properties = {
                          - metrics = [
                              - [
                                  - "AWS/ApplicationELB",
                                  - "TargetResponseTime",
                                  - "LoadBalancer",
                                  - "app/spotify-line-bot-develop/705c461e88da1532",
                                  - {
                                      - period = 60
                                      - stat   = "p50"
                                    },
                                ],
                              - [
                                  - "...",
                                  - {
                                      - color  = "#c5b0d5"
                                      - period = 60
                                      - stat   = "p90"
                                    },
                                ],
                              - [
                                  - "...",
                                  - {
                                      - color  = "#dbdb8d"
                                      - period = 60
                                      - stat   = "p99"
                                    },
                                ],
                            ]
                          - period  = 300
                          - region  = "ap-northeast-1"
                          - stacked = false
                          - title   = "Function response times"
                          - view    = "timeSeries"
                          - yAxis   = {
                              - left = {
                                  - max = 3
                                  - min = 0
                                }
                            }
                        }
                      - type       = "metric"
                      - width      = 12
                      - x          = 0
                      - y          = 6
                    },
                  - {
                      - height     = 6
                      - properties = {
                          - metrics = [
                              - [
                                  - "AWS/ApplicationELB",
                                  - "HTTPCode_Target_5XX_Count",
                                  - "LoadBalancer",
                                  - "app/spotify-line-bot-develop/705c461e88da1532",
                                  - {
                                      - color  = "#d62728"
                                      - period = 60
                                      - stat   = "Sum"
                                    },
                                ],
                              - [
                                  - ".",
                                  - "HTTPCode_Target_4XX_Count",
                                  - ".",
                                  - ".",
                                  - {
                                      - color  = "#bcbd22"
                                      - period = 60
                                      - stat   = "Sum"
                                    },
                                ],
                              - [
                                  - ".",
                                  - "HTTPCode_Target_3XX_Count",
                                  - ".",
                                  - ".",
                                  - {
                                      - color  = "#98df8a"
                                      - period = 60
                                      - stat   = "Sum"
                                    },
                                ],
                              - [
                                  - ".",
                                  - "HTTPCode_Target_2XX_Count",
                                  - ".",
                                  - ".",
                                  - {
                                      - color  = "#2ca02c"
                                      - period = 60
                                      - stat   = "Sum"
                                    },
                                ],
                            ]
                          - period  = 300
                          - region  = "ap-northeast-1"
                          - stacked = true
                          - title   = "Load balancer responses"
                          - view    = "timeSeries"
                          - yAxis   = {
                              - left = {
                                  - min = 0
                                }
                            }
                        }
                      - type       = "metric"
                      - width      = 12
                      - x          = 0
                      - y          = 0
                    },
                  - {
                      - height     = 6
                      - properties = {
                          - metrics = [
                              - [
                                  - "AWS/Lambda",
                                  - "Throttles",
                                  - "FunctionName",
                                  - "java_lambda_function",
                                  - {
                                      - color   = "#ff7f0e"
                                      - period  = 60
                                      - stat    = "Average"
                                      - visible = false
                                    },
                                ],
                              - [
                                  - ".",
                                  - "Invocations",
                                  - ".",
                                  - ".",
                                  - {
                                      - color   = "#2ca02c"
                                      - period  = 60
                                      - stat    = "Average"
                                      - visible = false
                                    },
                                ],
                              - [
                                  - ".",
                                  - "Duration",
                                  - ".",
                                  - ".",
                                  - {
                                      - color  = "#9467bd"
                                      - period = 60
                                      - stat   = "Average"
                                    },
                                ],
                            ]
                          - period  = 300
                          - region  = "ap-northeast-1"
                          - stacked = false
                          - title   = "Function Duration"
                          - view    = "timeSeries"
                          - yAxis   = {
                              - left = {
                                  - max = 100
                                  - min = 0
                                }
                            }
                        }
                      - type       = "metric"
                      - width      = 12
                      - x          = 12
                      - y          = 6
                    },
                ]
            }
        ) -> null
      - dashboard_name = "spotify-line-bot-develop" -> null
      - id             = "spotify-line-bot-develop" -> null
    }

  # module.alb-lambda.aws_iam_role.app_role will be destroyed
  - resource "aws_iam_role" "app_role" {
      - arn                   = "arn:aws:iam::554506578892:role/spotify-line-bot-develop" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-07-22T03:24:36Z" -> null
      - force_detach_policies = false -> null
      - id                    = "spotify-line-bot-develop" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "spotify-line-bot-develop" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAYCGZK5PGB6JPUV477" -> null

      - inline_policy {
          - name   = "cw-spotify-line-bot-develop" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                              - "ec2:DescribeNetworkInterfaces",
                              - "ec2:CreateNetworkInterface",
                              - "ec2:DeleteNetworkInterface",
                              - "ec2:DescribeInstances",
                              - "ec2:AttachNetworkInterface",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.alb-lambda.aws_iam_role_policy.cloudwatch will be destroyed
  - resource "aws_iam_role_policy" "cloudwatch" {
      - id     = "spotify-line-bot-develop:cw-spotify-line-bot-develop" -> null
      - name   = "cw-spotify-line-bot-develop" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                          - "ec2:DescribeNetworkInterfaces",
                          - "ec2:CreateNetworkInterface",
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:DescribeInstances",
                          - "ec2:AttachNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "spotify-line-bot-develop" -> null
    }

  # module.alb-lambda.aws_internet_gateway.main will be destroyed
  - resource "aws_internet_gateway" "main" {
      - arn      = "arn:aws:ec2:ap-northeast-1:554506578892:internet-gateway/igw-0ecc8ba5f070e3a1c" -> null
      - id       = "igw-0ecc8ba5f070e3a1c" -> null
      - owner_id = "554506578892" -> null
      - tags     = {
          - "Name" = "spotify-line-bot"
        } -> null
      - tags_all = {
          - "Name" = "spotify-line-bot"
        } -> null
      - vpc_id   = "vpc-06be3f4bb32bf767f" -> null
    }

  # module.alb-lambda.aws_lambda_permission.allow_alb_to_invoke_lambda will be destroyed
  - resource "aws_lambda_permission" "allow_alb_to_invoke_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "java_lambda_function" -> null
      - id            = "AllowExecutionFromALB" -> null
      - principal     = "elasticloadbalancing.amazonaws.com" -> null
      - source_arn    = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/spotify-line-bot-develop/c0d7778a20579ddf" -> null
      - statement_id  = "AllowExecutionFromALB" -> null
    }

  # module.alb-lambda.aws_lb_target_group_attachment.main will be destroyed
  - resource "aws_lb_target_group_attachment" "main" {
      - id               = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/spotify-line-bot-develop/c0d7778a20579ddf-20210722032501636900000002" -> null
      - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:554506578892:targetgroup/spotify-line-bot-develop/c0d7778a20579ddf" -> null
      - target_id        = "arn:aws:lambda:ap-northeast-1:554506578892:function:java_lambda_function" -> null
    }

  # module.alb-lambda.aws_route.public will be destroyed
  - resource "aws_route" "public" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-0ecc8ba5f070e3a1c" -> null
      - id                     = "r-rtb-0d9cdefb8207863bd1080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0d9cdefb8207863bd" -> null
      - state                  = "active" -> null
    }

  # module.alb-lambda.aws_route53_record.main will be destroyed
  - resource "aws_route53_record" "main" {
      - fqdn    = "spotify-line-bot.moikilo00.net" -> null
      - id      = "Z04052072YGY8CIREK2A2_spotify-line-bot.moikilo00.net_CNAME" -> null
      - name    = "spotify-line-bot.moikilo00.net" -> null
      - records = [
          - "spotify-line-bot-develop-1984214338.ap-northeast-1.elb.amazonaws.com",
        ] -> null
      - ttl     = 30 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z04052072YGY8CIREK2A2" -> null
    }

  # module.alb-lambda.aws_route53_record.validations["spotify-line-bot.moikilo00.net"] will be destroyed
  - resource "aws_route53_record" "validations" {
      - fqdn    = "_5e39c3066d148ff7098e8aff2206c4e9.spotify-line-bot.moikilo00.net" -> null
      - id      = "Z04052072YGY8CIREK2A2__5e39c3066d148ff7098e8aff2206c4e9.spotify-line-bot.moikilo00.net._CNAME" -> null
      - name    = "_5e39c3066d148ff7098e8aff2206c4e9.spotify-line-bot.moikilo00.net" -> null
      - records = [
          - "_8d14945b5eeab67de2d726be1a11c433.tgztlnjmjp.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z04052072YGY8CIREK2A2" -> null
    }

  # module.alb-lambda.aws_route_table.public will be destroyed
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:ap-northeast-1:554506578892:route-table/rtb-0d9cdefb8207863bd" -> null
      - id               = "rtb-0d9cdefb8207863bd" -> null
      - owner_id         = "554506578892" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-0ecc8ba5f070e3a1c"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "spotify-line-bot-public"
        } -> null
      - tags_all         = {
          - "Name" = "spotify-line-bot-public"
        } -> null
      - vpc_id           = "vpc-06be3f4bb32bf767f" -> null
    }

  # module.alb-lambda.aws_route_table_association.public[0] will be destroyed
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0154854afe57eec1b" -> null
      - route_table_id = "rtb-0d9cdefb8207863bd" -> null
      - subnet_id      = "subnet-0b97e1bb37b7dfab2" -> null
    }

  # module.alb-lambda.aws_route_table_association.public[1] will be destroyed
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0d744d0d6d3a2e7f7" -> null
      - route_table_id = "rtb-0d9cdefb8207863bd" -> null
      - subnet_id      = "subnet-0c44b50b1f455b098" -> null
    }

  # module.alb-lambda.aws_route_table_association.public[2] will be destroyed
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-02cb0e043150ade26" -> null
      - route_table_id = "rtb-0d9cdefb8207863bd" -> null
      - subnet_id      = "subnet-01f5364194630546b" -> null
    }

  # module.alb-lambda.aws_s3_bucket.lb_access_logs will be destroyed
  - resource "aws_s3_bucket" "lb_access_logs" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::spotify-line-bot-develop-lb-access-logs" -> null
      - bucket                      = "spotify-line-bot-develop-lb-access-logs" -> null
      - bucket_domain_name          = "spotify-line-bot-develop-lb-access-logs.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "spotify-line-bot-develop-lb-access-logs.s3.ap-northeast-1.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z2M4EHUR26P7ZW" -> null
      - id                          = "spotify-line-bot-develop-lb-access-logs" -> null
      - region                      = "ap-northeast-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name" = "spotify-line-develop"
        } -> null
      - tags_all                    = {
          - "Name" = "spotify-line-develop"
        } -> null

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 1 -> null
          - enabled                                = true -> null
          - id                                     = "cleanup" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 3 -> null
              - expired_object_delete_marker = false -> null
            }
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.alb-lambda.aws_s3_bucket_policy.lb_access_logs will be destroyed
  - resource "aws_s3_bucket_policy" "lb_access_logs" {
      - bucket = "spotify-line-bot-develop-lb-access-logs" -> null
      - id     = "spotify-line-bot-develop-lb-access-logs" -> null
      - policy = jsonencode(
            {
              - Id        = "Policy"
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::582318560864:root"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::spotify-line-bot-develop-lb-access-logs",
                          - "arn:aws:s3:::spotify-line-bot-develop-lb-access-logs/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.alb-lambda.aws_security_group.nsg_lambda will be destroyed
  - resource "aws_security_group" "nsg_lambda" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:554506578892:security-group/sg-033b149fcb4b7e709" -> null
      - description            = "Limit connections from internal resources while allowing spotify-line-bot-develop-lambda to connect to all external resources" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allows lambda to establish connections to all resources"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-033b149fcb4b7e709" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Only allow connections from SG spotify-line-bot-develop-lb on port 80"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-06a2f9348ee5a05a5",
                ]
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "spotify-line-bot-develop-lambda" -> null
      - owner_id               = "554506578892" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "spotify-line-develop"
        } -> null
      - tags_all               = {
          - "Name" = "spotify-line-develop"
        } -> null
      - vpc_id                 = "vpc-06be3f4bb32bf767f" -> null
    }

  # module.alb-lambda.aws_security_group.nsg_lb will be destroyed
  - resource "aws_security_group" "nsg_lb" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:554506578892:security-group/sg-06a2f9348ee5a05a5" -> null
      - description            = "Allow connections from external resources while limiting connections from spotify-line-bot-develop-lb to internal resources" -> null
      - egress                 = [
          - {
              - cidr_blocks      = []
              - description      = "Only allow SG spotify-line-bot-develop-lb to connect to spotify-line-bot-develop-lambda on port 80"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-033b149fcb4b7e709",
                ]
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - id                     = "sg-06a2f9348ee5a05a5" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTP"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTPS"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "spotify-line-bot-develop-lb" -> null
      - owner_id               = "554506578892" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "spotify-line-develop"
        } -> null
      - tags_all               = {
          - "Name" = "spotify-line-develop"
        } -> null
      - vpc_id                 = "vpc-06be3f4bb32bf767f" -> null
    }

  # module.alb-lambda.aws_security_group_rule.ingress_lb_http will be destroyed
  - resource "aws_security_group_rule" "ingress_lb_http" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "HTTP" -> null
      - from_port         = 80 -> null
      - id                = "sgrule-2805189883" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-06a2f9348ee5a05a5" -> null
      - self              = false -> null
      - to_port           = 80 -> null
      - type              = "ingress" -> null
    }

  # module.alb-lambda.aws_security_group_rule.ingress_lb_https will be destroyed
  - resource "aws_security_group_rule" "ingress_lb_https" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "HTTPS" -> null
      - from_port         = 443 -> null
      - id                = "sgrule-3283710764" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-06a2f9348ee5a05a5" -> null
      - self              = false -> null
      - to_port           = 443 -> null
      - type              = "ingress" -> null
    }

  # module.alb-lambda.aws_security_group_rule.nsg_lambda_egress_rule will be destroyed
  - resource "aws_security_group_rule" "nsg_lambda_egress_rule" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "Allows lambda to establish connections to all resources" -> null
      - from_port         = 0 -> null
      - id                = "sgrule-1358367443" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-033b149fcb4b7e709" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module.alb-lambda.aws_security_group_rule.nsg_lambda_ingress_rule will be destroyed
  - resource "aws_security_group_rule" "nsg_lambda_ingress_rule" {
      - cidr_blocks              = [] -> null
      - description              = "Only allow connections from SG spotify-line-bot-develop-lb on port 80" -> null
      - from_port                = 80 -> null
      - id                       = "sgrule-2429044596" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-033b149fcb4b7e709" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-06a2f9348ee5a05a5" -> null
      - to_port                  = 80 -> null
      - type                     = "ingress" -> null
    }

  # module.alb-lambda.aws_security_group_rule.nsg_lb_egress_rule will be destroyed
  - resource "aws_security_group_rule" "nsg_lb_egress_rule" {
      - cidr_blocks              = [] -> null
      - description              = "Only allow SG spotify-line-bot-develop-lb to connect to spotify-line-bot-develop-lambda on port 80" -> null
      - from_port                = 80 -> null
      - id                       = "sgrule-4251056976" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-06a2f9348ee5a05a5" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-033b149fcb4b7e709" -> null
      - to_port                  = 80 -> null
      - type                     = "egress" -> null
    }

  # module.alb-lambda.aws_subnet.publics[0] will be destroyed
  - resource "aws_subnet" "publics" {
      - arn                             = "arn:aws:ec2:ap-northeast-1:554506578892:subnet/subnet-0b97e1bb37b7dfab2" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "ap-northeast-1a" -> null
      - availability_zone_id            = "apne1-az4" -> null
      - cidr_block                      = "10.0.0.0/24" -> null
      - id                              = "subnet-0b97e1bb37b7dfab2" -> null
      - map_customer_owned_ip_on_launch = false -> null
      - map_public_ip_on_launch         = false -> null
      - owner_id                        = "554506578892" -> null
      - tags                            = {
          - "Name" = "spotify-line-bot-public-0"
        } -> null
      - tags_all                        = {
          - "Name" = "spotify-line-bot-public-0"
        } -> null
      - vpc_id                          = "vpc-06be3f4bb32bf767f" -> null
    }

  # module.alb-lambda.aws_subnet.publics[1] will be destroyed
  - resource "aws_subnet" "publics" {
      - arn                             = "arn:aws:ec2:ap-northeast-1:554506578892:subnet/subnet-0c44b50b1f455b098" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "ap-northeast-1c" -> null
      - availability_zone_id            = "apne1-az1" -> null
      - cidr_block                      = "10.0.1.0/24" -> null
      - id                              = "subnet-0c44b50b1f455b098" -> null
      - map_customer_owned_ip_on_launch = false -> null
      - map_public_ip_on_launch         = false -> null
      - owner_id                        = "554506578892" -> null
      - tags                            = {
          - "Name" = "spotify-line-bot-public-1"
        } -> null
      - tags_all                        = {
          - "Name" = "spotify-line-bot-public-1"
        } -> null
      - vpc_id                          = "vpc-06be3f4bb32bf767f" -> null
    }

  # module.alb-lambda.aws_subnet.publics[2] will be destroyed
  - resource "aws_subnet" "publics" {
      - arn                             = "arn:aws:ec2:ap-northeast-1:554506578892:subnet/subnet-01f5364194630546b" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "ap-northeast-1d" -> null
      - availability_zone_id            = "apne1-az2" -> null
      - cidr_block                      = "10.0.2.0/24" -> null
      - id                              = "subnet-01f5364194630546b" -> null
      - map_customer_owned_ip_on_launch = false -> null
      - map_public_ip_on_launch         = false -> null
      - owner_id                        = "554506578892" -> null
      - tags                            = {
          - "Name" = "spotify-line-bot-public-2"
        } -> null
      - tags_all                        = {
          - "Name" = "spotify-line-bot-public-2"
        } -> null
      - vpc_id                          = "vpc-06be3f4bb32bf767f" -> null
    }

  # module.alb-lambda.aws_vpc.main will be destroyed
  - resource "aws_vpc" "main" {
      - arn                              = "arn:aws:ec2:ap-northeast-1:554506578892:vpc/vpc-06be3f4bb32bf767f" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.0.0.0/16" -> null
      - default_network_acl_id           = "acl-08084649073366f26" -> null
      - default_route_table_id           = "rtb-03be52b6bb58943d5" -> null
      - default_security_group_id        = "sg-0e93827d9a53908d0" -> null
      - dhcp_options_id                  = "dopt-247a4743" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = true -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-06be3f4bb32bf767f" -> null
      - instance_tenancy                 = "default" -> null
      - main_route_table_id              = "rtb-03be52b6bb58943d5" -> null
      - owner_id                         = "554506578892" -> null
      - tags                             = {
          - "Name" = "spotify-line-bot"
        } -> null
      - tags_all                         = {
          - "Name" = "spotify-line-bot"
        } -> null
    }

Plan: 4 to add, 2 to change, 36 to destroy.

Changes to Outputs:
  ~ base_url = "https://uo7vejn591.execute-api.ap-northeast-1.amazonaws.com/test" -> (known after apply)

Warning: Quoted references are deprecated

  on cert-route.tf line 27, in resource "aws_acm_certificate" "main":
  27:   provider          = "aws.virginia"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>




*Pusher: @lazmond3, Action: `pull_request`*